package ch03_op;
/*
 *	비트연산자 : &(and), |(or), ^(XOR), ~(not) 
 *	& and : 피연산자 양쪽이 1이면 1을 얻는다. 그 외는 0
 *	| or  : 피연산자 둘중 한쪽이 1이면 1을 얻는다. 그 외는 0
 *  ^ XOR : 피연산자 서로 다르면 1을 얻는다. 같을 경우는 0
 *  ~ not : 반전 0은 1로 1은 0으로.
 *  
 *  6 : 0110
 *	3 : 0011
 *	--------
 *	& : 0010  :2
 *
 *	6 : 0110
 *	3 : 0011
 *	--------
 *	| : 0111  :7
 *
 *	6 : 0110
 *	3 : 0011
 *	--------
 *	^ : 0101  :5
 *
 *	10 : 00001010
 *	-------------
 *	 ~ : 11110101 :-11 
 *	
 */
public class Op_Ex_06 {

	public static void main(String[] args) {

		System.out.println("6 & 3 = "+ (6 & 3));
		/*  6 : 0110
		 *	3 : 0011
		 *	--------
		 *	& : 0010  :2
		 */
		
		System.out.println("6 | 3 = "+ (6 | 3));
		/*  6 : 0110
		 *	3 : 0011
		 *	--------
		 *	| : 0111  :7
		 */
		
		System.out.println("6 ^ 3 = "+ (6 ^ 3));
		/*	6 : 0110
		 *	3 : 0011
		 *	--------
		 *	^ : 0101  :5
		 */
		
		System.out.println("~10 =  "+ ~10);
		/*	10 : 00001010
		 *	-------------
		 *	 ~ : 11110101 :-11 
		 *	
		 */

	}

}
